In [1]:
a = "Hello world I am python"
print(a[0:5])

Hello

In [4]:
a[0:10:2]

'Hlowr'

In [5]:
len(a)

23

In [6]:
n = len(a)
a[n::-1]

'nohtyp ma I dlrow olleH'

In [7]:
a = "Apple"
b = " Ball"
c = print(a+b) #conncation

Apple Ball

In [12]:
print(c)

None

In [13]:
a = input("Enter a = ")
b = input("Enter b = ")
print(a+b)

Enter a = 14
Enter b = 14
1414

In [14]:
c=a+b

In [15]:
a = "Hello World"
b = 10
print(a+str(b))

Hello World10

In [18]:
c=f"{a} {b}"

In [19]:
c

'Hello World 10'

In [23]:
name = "Santosh Basnet"
age = 27
c= f"My name is {name}. I am {age} year old"

In [24]:
c

'My name is Santosh Basnet. I am 27 year old'

In [28]:
s=""
n=int(input("Enter the value of n"))
for i in range(n):
    name=input("Enter your name")
    phone=int(input("Enter your phone number: "))
    info = f"My name is {name}. My contact number is {phone}.\n"
    s=s+info
print(info)
print(s)

Enter the value of n2
Enter your nameram
Enter your phone number: 98544
Enter your namehari
Enter your phone number: 95845
My name is hari. My contact number is 95845.

My name is ram. My contact number is 98544.
My name is hari. My contact number is 95845.

In [32]:
print(s.upper())

MY NAME IS RAM. MY CONTACT NUMBER IS 98544.
MY NAME IS HARI. MY CONTACT NUMBER IS 95845.

In [36]:

print(s.replace("RAM", "Sharma"))

MY NAME IS Sharma. MY CONTACT NUMBER IS 98544.

In [39]:
a = "Ram Shyam Hari Gita Ram"
name = input("Enter Name")
if "Ram" in a:
    print(a.count(name))

Enter NameRam
2

In [40]:
a = "Ram Shyam Hari Gita"
a.split('\n')

['Ram Shyam Hari Gita']

In [41]:
a = (1,2,3,4)
print(a)

(1, 2, 3, 4)

In [42]:
a = ("Apple","Ball")
print(a[1])

Ball

In [43]:
type(a)

tuple

In [44]:
b = ("Apple",)
c = ("Ball",)
print(a+b)

('Apple', 'Ball', 'Apple')

In [47]:
t=tuple()
n=int(input("Enter the value of n"))
for i in range(n):
    x=int(input("Enter the value of x"))
    t=t+(x,)
print(t)

Enter the value of n2
Enter the value of x5
Enter the value of x5
(5, 5)

In [48]:
print("The sum of t is ", sum(t))

The sum of t is  10

In [49]:
print("The max value is ", max(t))

The max value is  5

In [50]:
print("The min value is ", min(t))

The min value is  5

In [51]:
sorted(t)

[5, 5]

In [52]:
print(list(t))

[5, 5]

In [53]:
print(set(t))

{5}

In [54]:
print(tuple(t))

(5, 5)

In [63]:
data = tuple() 
n = int(input("Enter n = "))
for i in range(n):
    name = input("Enter name = ")
    ntc = int(input("Enter ntc number = "))
    ncell = int(input("Enter ncell no = "))
    info = (name,ntc,ncell)
    data = data+(info,)
    
print(data)

Enter n = 2
Enter name = ram
Enter ntc number = 9854
Enter ncell no = 985458
Enter name = Hari
Enter ntc number = 985642
Enter ncell no = 985648
(('ram', 9854, 985458), ('Hari', 985642, 985648))

In [64]:
for i in data:
    print(i)

('ram', 9854, 985458)
('Hari', 985642, 985648)

In [65]:
list(i)

['Hari', 985642, 985648]

In [66]:
set(i)

{985642, 985648, 'Hari'}

In [67]:
a = ([1,3,4],[4,6,7,8])
print(len(a))

2

In [68]:
a[0]

[1, 3, 4]

In [69]:
a[0][2]

4

In [70]:
del a[0][2]
a

([1, 3], [4, 6, 7, 8])

In [77]:
c=()
a = [[1,3,4,5],
     [5,6,6,5]]
b = list(a)
for i in a:
    x = tuple(i)
    c=c+(x,)
c

((1, 3, 4, 5), (5, 6, 6, 5))

In [78]:
c = []
a = ((1,3,4,5),
     (5,6,6,5))
list(a)

[(1, 3, 4, 5), (5, 6, 6, 5)]

In [83]:
for i in a:
    x=list(i)
    c.append(x)

AttributeError: 'NoneType' object has no attribute 'append'

In [80]:
c

[(1, 3, 4, 5), (5, 6, 6, 5), (1, 3, 4, 5), (5, 6, 6, 5)]

In [93]:
b = open("data.txt",'w')
c="Hello I am santosh"
b.write(c)
print(c)
print(type(c))
b.close()

Hello I am santosh
<class 'str'>

In [92]:
b = open('data.txt','r')
n = int(input("Enter n = "))
for i in range(n):
    c = b.read()
    print(c)
    print(type(c))
b.close()

Enter n = 3
/n.Hello world
<class 'str'>

<class 'str'>

<class 'str'>

In [94]:
#csv file
s = ""
total = 0
n = int(input("Enter n = "))
b = open("bil.csv","w")
for i in range(n):
    name = input("Enter name = ")
    price = int(input("Enter price = ")) #toral
    quantity = int(input("Enter quantity = "))
    total = quantity*price
    s = s+f"{name} {price} {quantity} {total}\n"
        
print(s)
print(total)
b.write(s)
b.close()

Enter n = 2
Enter name = ram
Enter price = 25
Enter quantity = 25
Enter name = ra
Enter price = 25
Enter quantity = 25
ram 25 25 625
ra 25 25 625

625

In [95]:
b = open("bil.csv","r") #to open
c = b.read()
print(c)
b.close()

ram 25 25 625
ra 25 25 625

In [97]:
import shutil #copy
src = 'bil.csv'
dst = 'Untitled Folder'
shutil.copy(src,dst)

'Untitled Folder\\bil.csv'

In [98]:
b = open("TellimagranidinII.pdb","r") #to open
c = b.read()
print(c)
b.close()

FileNotFoundError: [Errno 2] No such file or directory: 'TellimagranidinII.pdb'

In [1]:
b = open("data.csv","r")
c = b.read()
print(c)
b.close()

SN,Name,Age,Address
1,Ram,23,Kathmandu
2,Shyam,45,Bara
3,Nabin,54,Pokhara
4,Santosh,45,Slolu
5,Aayush,64,KTM
6,Hari,43,Jhapa

In [3]:
import pandas as pd
df = pd.read_csv("data.csv")

In [4]:
df

   SN     Name  Age    Address
0   1      Ram   23  Kathmandu
1   2    Shyam   45       Bara
2   3    Nabin   54    Pokhara
3   4  Santosh   45      Slolu
4   5   Aayush   64        KTM
5   6     Hari   43      Jhapa

In [5]:
df = pd.read_csv("data.csv",nrows=5)

In [6]:
df

   SN     Name  Age    Address
0   1      Ram   23  Kathmandu
1   2    Shyam   45       Bara
2   3    Nabin   54    Pokhara
3   4  Santosh   45      Slolu
4   5   Aayush   64        KTM

In [7]:
df.head(3)

   SN   Name  Age    Address
0   1    Ram   23  Kathmandu
1   2  Shyam   45       Bara
2   3  Nabin   54    Pokhara

In [8]:
df.tail(3)

   SN     Name  Age  Address
2   3    Nabin   54  Pokhara
3   4  Santosh   45    Slolu
4   5   Aayush   64      KTM

In [9]:
df = pd.read_csv("data.csv", index_col="SN")

In [10]:
df

       Name  Age    Address
SN
1       Ram   23  Kathmandu
2     Shyam   45       Bara
3     Nabin   54    Pokhara
4   Santosh   45      Slolu
5    Aayush   64        KTM
6      Hari   43      Jhapa

In [11]:
df = pd.read_csv("data.csv", index_col="SN", usecols=["SN", "Name", "Age"])

In [12]:
df

       Name  Age
SN
1       Ram   23
2     Shyam   45
3     Nabin   54
4   Santosh   45
5    Aayush   64
6      Hari   43

In [25]:
df.iloc[0:2, 0:4]

     Name  Age
SN
1     Ram   23
2   Shyam   45

In [26]:
df.loc[2:5]

       Name  Age
SN
2     Shyam   45
3     Nabin   54
4   Santosh   45
5    Aayush   64

In [27]:
df.loc['Nabin':'Aayush']

Empty DataFrame
Columns: [Name, Age]
Index: []

In [30]:
import csv
fields = ['Kamal',28,'Baluwatar']
with open('books.csv','a') as f: #new way to open not necessory to close
    x=csv.writer(f)
    x.writerow(fields)

In [31]:
result = []
n = int(input("Enter n = "))
for i in range(1,n+1):
    name = input("Enter name = ")
    physics = int(input("Enter marks"))
    chemistry = int(input("Enter marks"))
    math = int(input("Enter marks"))
    english = int(input("Enter marks"))
    total = sum([physics,chemistry,math,english])
    per = total/4
    marks = [i,name,physics,chemistry,math,english,total,per]
    result.append(marks)
print(result)

Enter n = 2
Enter name = ram
Enter marks25
Enter marks25
Enter marks25
Enter marks25
Enter name = 25
Enter marks25
Enter marks25
Enter marks25
Enter marks25
[[1, 'ram', 25, 25, 25, 25, 100, 25.0], [2, '25', 25, 25, 25, 25, 100, 25.0]]

In [32]:
f=open("result1.csv",'w')
x=csv.writer(f)
for i in result:
    x.writerow(i)
f.close()

In [39]:
df=pd.read_csv("result.csv", index_col="SN")
df

       Name  Physics  Chemistry  Math  English  Total  Percentage
SN
1   Santosh       65         56    85       56    262       65.50
2      Hari       56         58     5       75    194       48.50
3       Ram       25         36    56       56    173       43.25

In [40]:
a = {'Santosh': ['9865623658', '9865986586'], 'Ram': ['9685689575', '9856895648']}
df=pd.DataFrame(a)
df

      Santosh         Ram
0  9865623658  9685689575
1  9865986586  9856895648

In [41]:
df.to_csv("Phone.csv")

In [42]:
df=pd.read_csv("Phone.csv")
df

   Unnamed: 0     Santosh         Ram
0           0  9865623658  9685689575
1           1  9865986586  9856895648

In [46]:
b = open('filtered_data.csv') #dictreader
reader=csv.DictReader(b)
for row in reader:
    print(row)

{'Name': 'Nabin', 'SN': '3', 'Age': '54', 'Address': 'Pokhara'}
{'Name': 'Santosh', 'SN': '4', 'Age': '45', 'Address': 'Slolu'}
{'Name': 'Aayush', 'SN': '5', 'Age': '64', 'Address': 'KTM'}

In [47]:
import csv #for update
final_data=[]
b = open('filtered_data.csv')
reader = csv.DictReader(b)

for row in reader:
    final_data.append(dict(row))
print(final_data)

[{'Name': 'Nabin', 'SN': '3', 'Age': '54', 'Address': 'Pokhara'}, {'Name': 'Santosh', 'SN': '4', 'Age': '45', 'Address': 'Slolu'}, {'Name': 'Aayush', 'SN': '5', 'Age': '64', 'Address': 'KTM'}]

In [50]:
a=4
b=4
if a>=b:
    print("A is greater")
elif a<=b:
    print("B is greater")
else:
    print("A and B both equal")

A is greater

In [54]:
a = "Hellow World"
for i in range( 5,6, 10):
    print(i,a)

5 Hellow World

In [58]:
n = input("Enter n = ")
for i in range(2,10):
    print(n*i)
m = input("Enter m = ")
for i in range(2,15):
    print(m*i)

Enter n = 6
66
666
6666
66666
666666
6666666
66666666
666666666
Enter m = 5

NameError: name 'Nepal' is not defined

In [66]:
n=int(input("Enter the value of n"))
for i in range(1,11):
    print(i, "X", n, "=" ,n*i)

Enter the value of n5
1 X 5 = 5
2 X 5 = 10
3 X 5 = 15
4 X 5 = 20
5 X 5 = 25
6 X 5 = 30
7 X 5 = 35
8 X 5 = 40
9 X 5 = 45
10 X 5 = 50

In [67]:
s = 0 #anywhere may be zero
n = int(input("nter n = "))
for i in range(n):
    x = int(input("Enter x ="))
    x = int(input("Enter x ="))
    s = s+x+x
    print(s)

nter n = 5
Enter x =5
Enter x =5
10
Enter x =5
Enter x =5
20
Enter x =5
Enter x =5
30
Enter x =5
Enter x =5
40
Enter x =5
Enter x =5
50

In [68]:
a = "Python"
for i in a:
    print(i)

P
y
t
h
o
n

In [69]:
a = "Python"
for i in a:
    print("Hellow World",end=" ")

Hellow World Hellow World Hellow World Hellow World Hellow World Hellow World

In [71]:
n = int(input("Enter n = "))
a = 1
while a<=10:
        print(n,"*",a,"=",n*a)
        a = a+3

Enter n = 5
5 * 1 = 5
5 * 4 = 20
5 * 7 = 35
5 * 10 = 50

In [72]:
def Hello():
    print("Hello wordl")
Hello()

Hello wordl

In [73]:
x="Hello World"
def Hello():
    print(x)
Hello()

Hello World

In [75]:
def area():
    r=5
    area=2*3.14*r
    print(area)
area()

31.400000000000002

In [ ]:
l = int(input("Enter l = ")) #global variable
b = int(input("Enter b = "))
def area():
    global a
    a = l*b
    print(a)
area()
print("This is outside the function",a)

In [ ]:
l = int(input("Enter l = ")) #global variable
b = int(input("Enter b = "))
def area():
    global a
    a = l*b
    print(a)
area()
print("This is outside the function",a)